"""Напишите программу, которая проверяет состоит ли введенная строка целиком из десятичных цифр
В качестве ответа необходимо вывести True, если условие выполняется, во всех остальных случаях нужно 
вывести False
Sample Input 1:
12345
Sample Output 1:
True"""
print(input().isdigit())

"""Напишите программу, которая проверяет состоит ли введенная строка целиком из заглавных букв
В качестве ответа необходимо вывести True, если условие выполняется, во всех остальных случаях нужно 
вывести False
Sample Input 1:
ABRACADABRA
Sample Output 1:
True"""
print(input().isupper())

"""Напишите программу, которая проверяет состоит ли введенная строка целиком из строчных букв
В качестве ответа необходимо вывести True, если условие выполняется, во всех остальных случаях нужно
 вывести False
Sample Input 1:
opportunity
Sample Output 1:
True"""
print(input().islower())
